# задание 2

print('Введите время в секундах')
a = input('time: ')
a = int(a)
if a >= 86400:
    print('ой, не больше 86400, пожалуйста')
elif a >= 3600:
    b = a // 3600
    c = a % 3600 // 60
    d = c % 60
    print(f'{b} ч {c} м {d} с')
    # print(b, 'ч', c, 'м', d, 'с')
elif a < 3600:
    b = a // 60
    c = a % 60
    print(b, 'м', c, 'с')

# задание 2 вариант 2

print('Введите время в секундах: ')
t = int(input('time: '))
d = t // 86400
h = t % 86400 // 3600
m = t % 86400 % 3600 // 60
c = t % 86400 % 3600 % 60
print(f'{d}д.{h}ч.{m}м.{c}с.')
